#Вычислите N! ("эн-факториал") – произведение всех натуральных чисел от 1 до N ( N!=1∙2∙3∙…∙ N ).
s = 1
i = 2
n = int(input())
for i in range(i, n+1):
    s = s * i
print(s)
